In [2]:
#import pandas 
import pandas as pd

In [3]:
#pandas has 2 main data type 
# first we tryout series data type 
# series data type is one dimensional 
# its input is list 
# pd.Series(list) - syntax will look like this

In [4]:
ser = pd.Series(["Maths","Physics","Chemistry","OOP"])

In [5]:
#print the series 
ser

0        Maths
1      Physics
2    Chemistry
3          OOP
dtype: object

In [6]:
ser2 = pd.Series(["Black","White","Blue","Red"])
ser2

0    Black
1    White
2     Blue
3      Red
dtype: object

In [7]:
#Another datatype is  DataFrame
# its 2 dimensional 
#its input argument is a dictionary 
df1 = pd.DataFrame({"Maths":[10,20,50,60,90] , "Grade":["F","F","P","B","G"]})
#MAths column contains the marks 
#Grade Column contains the Grade 
# marks less than 50 is failes so grade - F
# marks 50-59 - P
# marks 60-69 - B
# marks 70-79 - A
# marks 80-89 - G
#Now we can print the dataframe that we created just now 
df1

   Maths Grade
0     10     F
1     20     F
2     50     P
3     60     B
4     90     G

In [8]:
#this will give the datatype of each column
df1.dtypes

Maths     int64
Grade    object
dtype: object

In [9]:
#this will count total number of elemnts in each column
df1.count()

Maths    5
Grade    5
dtype: int64

In [10]:
#Lets create another Dataframe 
#gaming laptop brands 
model = pd.Series(["Asus","Lenova","Apple","Hp"])
price = pd.Series(["50K","45K","100K","65K"])
#So we created 2 Series of data 
gamelaptop = pd.DataFrame({
        "Model" : model , 
        "Price" : price , 
    })

gamelaptop

    Model Price
0    Asus   50K
1  Lenova   45K
2   Apple  100K
3      Hp   65K

In [11]:
# Now access particular row and column
#Firest access a particular column with index 
print("Price Column")
gamelaptop.loc[:,"Price"]

Price Column

0     50K
1     45K
2    100K
3     65K
Name: Price, dtype: object

In [12]:
#Now access the model name column 
print("Company name column")
gamelaptop.loc[:,"Model"]

Company name column

0      Asus
1    Lenova
2     Apple
3        Hp
Name: Model, dtype: object

In [13]:
# Now we can select a single row 
gamelaptop.loc[0,:]

Model    Asus
Price     50K
Name: 0, dtype: object

In [14]:
#get the column names
list(gamelaptop.keys())
for i in list(gamelaptop.keys()):
    print(gamelaptop.loc[:,i])
    #print(gamelaptop.loc[:,i])

0      Asus
1    Lenova
2     Apple
3        Hp
Name: Model, dtype: object
0     50K
1     45K
2    100K
3     65K
Name: Price, dtype: object

In [15]:
#acessing particular value from the table 
gamelaptop.loc[3,"Price"]

'65K'

In [16]:
#We can also read excel , csv files etc.
#Becoz when work with data we had data in some format like excel or csv type 

car_sales_data = pd.read_csv("data/car-sales.csv")

In [17]:
car_sales_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe Data

In [18]:
car_sales_data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [19]:
#get column index 
car_sales_data.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [20]:
#get row index 
car_sales_data.index

RangeIndex(start=0, stop=10, step=1)

In [21]:
car_sales_data.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [22]:
# price column not considered becoz , its type is object 
# its not a numerical value . describe() only work on numerical valued columns

In [23]:
#get the dimension 
car_sales_data.ndim

2

In [24]:
car_sales_data.size
#this will return total number of elements in the table 
# that means , each column has 10 elements 
# and we have total five columns . so total number of elements is 5 x 10  = 50

50

In [25]:
car_sales_data.axes
#this will give the axes of the dataframe

[RangeIndex(start=0, stop=10, step=1),
 Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')]

In [26]:
car_sales_data.info()
#this will give the overview of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [27]:
gamelaptop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Model   4 non-null      object
 1   Price   4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [28]:
#Statistical analysis 
#its only work on numerical valued columns 
car_sales_data.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [29]:
car_sales_data.median()

Odometer (KM)    57369.0
Doors                4.0
dtype: float64

In [30]:
car_sales_data.sum()
#this find the sum of each columns 
#if the datatype of elements in a column is not numerical values and its some object or string 
#this will add all the values together

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [31]:
car_sales_data.loc[:,"Odometer (KM)"].sum()

786014

In [32]:
#finding sum of a column 
car_sales_data["Odometer (KM)"].sum()

786014

## Viewing and Selecting Data

In [34]:
car_sales_data.head()
# ead only show the first n rows  in the table 
# if n is not defined , default n value is taken , which is 5

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [35]:
car_sales_data.head(8)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00

In [37]:
car_sales_data.tail()
# similarly tail() gives the last n rows 
# default value is 5

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [38]:
car_sales_data.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [50]:
#difference between loc() and iloc()

#first consider a Series with index manually specified 
names = pd.Series(["Arun","Jayan","Vivek","Vishal","Amal","Nikhil"],index=[0,2,3,6,2,0])
names

0      Arun
2     Jayan
3     Vivek
6    Vishal
2      Amal
0    Nikhil
dtype: object

In [51]:
names.loc[0]
#this will print all 0 indexed items

0      Arun
0    Nikhil
dtype: object

In [56]:
#Now try iloc
names.iloc[0]
#it will only give the first element
#becoz iiloc is not using index value that we specified 
#it looking the absolute position in the list / table

'Arun'

In [57]:
names.loc[2]
# this willl give all values with index =2

2    Jayan
2     Amal
dtype: object

In [59]:
names.iloc[2]
#this will only give values with absolute position 2

'Vivek'

In [63]:
# iloc and loc will help us to slice the table 
num = pd.Series([100,101,102,200,300,400,20])
num

0    100
1    101
2    102
3    200
4    300
5    400
6     20
dtype: int64

In [64]:
num.loc[0:4]

0    100
1    101
2    102
3    200
4    300
dtype: int64

In [65]:
num.loc[4:5]

4    300
5    400
dtype: int64

In [68]:
names

0      Arun
2     Jayan
3     Vivek
6    Vishal
2      Amal
0    Nikhil
dtype: object

In [70]:
names.iloc[2:4]
#iloc works on absolute pos

3     Vivek
6    Vishal
dtype: object

In [71]:
car_sales_data.iloc[3:6]

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00

In [72]:
car_sales_data["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [73]:
car_sales_data.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [74]:
car_sales_data.Price

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [75]:
# Boolean indexing 
# in this type of indexing we will not specifiy the index explicitly 
# instead of that we use some boolean condition 
car_sales_data[car_sales_data.Make == "Nissan"]

     Make Colour  Odometer (KM)  Doors      Price
4  Nissan  White         213095      4  $3,500.00
9  Nissan  White          31600      4  $9,700.00

In [ ]:
car_sales_data[car_sales_data. >=]